app/controllers/dashboards_controller.rb

  def index
    if false
      params = nil
    end
    @dashboards = Dashboard.all
---
SELECT "dashboards".* FROM "dashboards"